package discord.gamesdk;// Generated by jextract

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct DiscordCreateParams {
 *     DiscordClientId client_id;
 *     uint64_t flags;
 *     IDiscordCoreEvents *events;
 *     void *event_data;
 *     IDiscordApplicationEvents *application_events;
 *     DiscordVersion application_version;
 *     struct IDiscordUserEvents *user_events;
 *     DiscordVersion user_version;
 *     IDiscordImageEvents *image_events;
 *     DiscordVersion image_version;
 *     struct IDiscordActivityEvents *activity_events;
 *     DiscordVersion activity_version;
 *     struct IDiscordRelationshipEvents *relationship_events;
 *     DiscordVersion relationship_version;
 *     struct IDiscordLobbyEvents *lobby_events;
 *     DiscordVersion lobby_version;
 *     struct IDiscordNetworkEvents *network_events;
 *     DiscordVersion network_version;
 *     struct IDiscordOverlayEvents *overlay_events;
 *     DiscordVersion overlay_version;
 *     IDiscordStorageEvents *storage_events;
 *     DiscordVersion storage_version;
 *     struct IDiscordStoreEvents *store_events;
 *     DiscordVersion store_version;
 *     struct IDiscordVoiceEvents *voice_events;
 *     DiscordVersion voice_version;
 *     struct IDiscordAchievementEvents *achievement_events;
 *     DiscordVersion achievement_version;
 * }
 * }
 */
public class DiscordCreateParams {

    DiscordCreateParams() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        discord_game_sdk_h.C_LONG_LONG.withName("client_id"),
        discord_game_sdk_h.C_LONG_LONG.withName("flags"),
        discord_game_sdk_h.C_POINTER.withName("events"),
        discord_game_sdk_h.C_POINTER.withName("event_data"),
        discord_game_sdk_h.C_POINTER.withName("application_events"),
        discord_game_sdk_h.C_INT.withName("application_version"),
        MemoryLayout.paddingLayout(4),
        discord_game_sdk_h.C_POINTER.withName("user_events"),
        discord_game_sdk_h.C_INT.withName("user_version"),
        MemoryLayout.paddingLayout(4),
        discord_game_sdk_h.C_POINTER.withName("image_events"),
        discord_game_sdk_h.C_INT.withName("image_version"),
        MemoryLayout.paddingLayout(4),
        discord_game_sdk_h.C_POINTER.withName("activity_events"),
        discord_game_sdk_h.C_INT.withName("activity_version"),
        MemoryLayout.paddingLayout(4),
        discord_game_sdk_h.C_POINTER.withName("relationship_events"),
        discord_game_sdk_h.C_INT.withName("relationship_version"),
        MemoryLayout.paddingLayout(4),
        discord_game_sdk_h.C_POINTER.withName("lobby_events"),
        discord_game_sdk_h.C_INT.withName("lobby_version"),
        MemoryLayout.paddingLayout(4),
        discord_game_sdk_h.C_POINTER.withName("network_events"),
        discord_game_sdk_h.C_INT.withName("network_version"),
        MemoryLayout.paddingLayout(4),
        discord_game_sdk_h.C_POINTER.withName("overlay_events"),
        discord_game_sdk_h.C_INT.withName("overlay_version"),
        MemoryLayout.paddingLayout(4),
        discord_game_sdk_h.C_POINTER.withName("storage_events"),
        discord_game_sdk_h.C_INT.withName("storage_version"),
        MemoryLayout.paddingLayout(4),
        discord_game_sdk_h.C_POINTER.withName("store_events"),
        discord_game_sdk_h.C_INT.withName("store_version"),
        MemoryLayout.paddingLayout(4),
        discord_game_sdk_h.C_POINTER.withName("voice_events"),
        discord_game_sdk_h.C_INT.withName("voice_version"),
        MemoryLayout.paddingLayout(4),
        discord_game_sdk_h.C_POINTER.withName("achievement_events"),
        discord_game_sdk_h.C_INT.withName("achievement_version"),
        MemoryLayout.paddingLayout(4)
    ).withName("DiscordCreateParams");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong client_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("client_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordClientId client_id
     * }
     */
    public static final OfLong client_id$layout() {
        return client_id$LAYOUT;
    }

    private static final long client_id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordClientId client_id
     * }
     */
    public static final long client_id$offset() {
        return client_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordClientId client_id
     * }
     */
    public static long client_id(MemorySegment struct) {
        return struct.get(client_id$LAYOUT, client_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordClientId client_id
     * }
     */
    public static void client_id(MemorySegment struct, long fieldValue) {
        struct.set(client_id$LAYOUT, client_id$OFFSET, fieldValue);
    }

    private static final OfLong flags$LAYOUT = (OfLong)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t flags
     * }
     */
    public static final OfLong flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t flags
     * }
     */
    public static long flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t flags
     * }
     */
    public static void flags(MemorySegment struct, long fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final AddressLayout events$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("events"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * IDiscordCoreEvents *events
     * }
     */
    public static final AddressLayout events$layout() {
        return events$LAYOUT;
    }

    private static final long events$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * IDiscordCoreEvents *events
     * }
     */
    public static final long events$offset() {
        return events$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * IDiscordCoreEvents *events
     * }
     */
    public static MemorySegment events(MemorySegment struct) {
        return struct.get(events$LAYOUT, events$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * IDiscordCoreEvents *events
     * }
     */
    public static void events(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(events$LAYOUT, events$OFFSET, fieldValue);
    }

    private static final AddressLayout event_data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("event_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *event_data
     * }
     */
    public static final AddressLayout event_data$layout() {
        return event_data$LAYOUT;
    }

    private static final long event_data$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *event_data
     * }
     */
    public static final long event_data$offset() {
        return event_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *event_data
     * }
     */
    public static MemorySegment event_data(MemorySegment struct) {
        return struct.get(event_data$LAYOUT, event_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *event_data
     * }
     */
    public static void event_data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(event_data$LAYOUT, event_data$OFFSET, fieldValue);
    }

    private static final AddressLayout application_events$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("application_events"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * IDiscordApplicationEvents *application_events
     * }
     */
    public static final AddressLayout application_events$layout() {
        return application_events$LAYOUT;
    }

    private static final long application_events$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * IDiscordApplicationEvents *application_events
     * }
     */
    public static final long application_events$offset() {
        return application_events$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * IDiscordApplicationEvents *application_events
     * }
     */
    public static MemorySegment application_events(MemorySegment struct) {
        return struct.get(application_events$LAYOUT, application_events$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * IDiscordApplicationEvents *application_events
     * }
     */
    public static void application_events(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(application_events$LAYOUT, application_events$OFFSET, fieldValue);
    }

    private static final OfInt application_version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("application_version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordVersion application_version
     * }
     */
    public static final OfInt application_version$layout() {
        return application_version$LAYOUT;
    }

    private static final long application_version$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordVersion application_version
     * }
     */
    public static final long application_version$offset() {
        return application_version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordVersion application_version
     * }
     */
    public static int application_version(MemorySegment struct) {
        return struct.get(application_version$LAYOUT, application_version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordVersion application_version
     * }
     */
    public static void application_version(MemorySegment struct, int fieldValue) {
        struct.set(application_version$LAYOUT, application_version$OFFSET, fieldValue);
    }

    private static final AddressLayout user_events$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("user_events"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct IDiscordUserEvents *user_events
     * }
     */
    public static final AddressLayout user_events$layout() {
        return user_events$LAYOUT;
    }

    private static final long user_events$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct IDiscordUserEvents *user_events
     * }
     */
    public static final long user_events$offset() {
        return user_events$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct IDiscordUserEvents *user_events
     * }
     */
    public static MemorySegment user_events(MemorySegment struct) {
        return struct.get(user_events$LAYOUT, user_events$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct IDiscordUserEvents *user_events
     * }
     */
    public static void user_events(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(user_events$LAYOUT, user_events$OFFSET, fieldValue);
    }

    private static final OfInt user_version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("user_version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordVersion user_version
     * }
     */
    public static final OfInt user_version$layout() {
        return user_version$LAYOUT;
    }

    private static final long user_version$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordVersion user_version
     * }
     */
    public static final long user_version$offset() {
        return user_version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordVersion user_version
     * }
     */
    public static int user_version(MemorySegment struct) {
        return struct.get(user_version$LAYOUT, user_version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordVersion user_version
     * }
     */
    public static void user_version(MemorySegment struct, int fieldValue) {
        struct.set(user_version$LAYOUT, user_version$OFFSET, fieldValue);
    }

    private static final AddressLayout image_events$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("image_events"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * IDiscordImageEvents *image_events
     * }
     */
    public static final AddressLayout image_events$layout() {
        return image_events$LAYOUT;
    }

    private static final long image_events$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * IDiscordImageEvents *image_events
     * }
     */
    public static final long image_events$offset() {
        return image_events$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * IDiscordImageEvents *image_events
     * }
     */
    public static MemorySegment image_events(MemorySegment struct) {
        return struct.get(image_events$LAYOUT, image_events$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * IDiscordImageEvents *image_events
     * }
     */
    public static void image_events(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(image_events$LAYOUT, image_events$OFFSET, fieldValue);
    }

    private static final OfInt image_version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("image_version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordVersion image_version
     * }
     */
    public static final OfInt image_version$layout() {
        return image_version$LAYOUT;
    }

    private static final long image_version$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordVersion image_version
     * }
     */
    public static final long image_version$offset() {
        return image_version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordVersion image_version
     * }
     */
    public static int image_version(MemorySegment struct) {
        return struct.get(image_version$LAYOUT, image_version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordVersion image_version
     * }
     */
    public static void image_version(MemorySegment struct, int fieldValue) {
        struct.set(image_version$LAYOUT, image_version$OFFSET, fieldValue);
    }

    private static final AddressLayout activity_events$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("activity_events"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct IDiscordActivityEvents *activity_events
     * }
     */
    public static final AddressLayout activity_events$layout() {
        return activity_events$LAYOUT;
    }

    private static final long activity_events$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct IDiscordActivityEvents *activity_events
     * }
     */
    public static final long activity_events$offset() {
        return activity_events$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct IDiscordActivityEvents *activity_events
     * }
     */
    public static MemorySegment activity_events(MemorySegment struct) {
        return struct.get(activity_events$LAYOUT, activity_events$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct IDiscordActivityEvents *activity_events
     * }
     */
    public static void activity_events(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(activity_events$LAYOUT, activity_events$OFFSET, fieldValue);
    }

    private static final OfInt activity_version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("activity_version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordVersion activity_version
     * }
     */
    public static final OfInt activity_version$layout() {
        return activity_version$LAYOUT;
    }

    private static final long activity_version$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordVersion activity_version
     * }
     */
    public static final long activity_version$offset() {
        return activity_version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordVersion activity_version
     * }
     */
    public static int activity_version(MemorySegment struct) {
        return struct.get(activity_version$LAYOUT, activity_version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordVersion activity_version
     * }
     */
    public static void activity_version(MemorySegment struct, int fieldValue) {
        struct.set(activity_version$LAYOUT, activity_version$OFFSET, fieldValue);
    }

    private static final AddressLayout relationship_events$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("relationship_events"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct IDiscordRelationshipEvents *relationship_events
     * }
     */
    public static final AddressLayout relationship_events$layout() {
        return relationship_events$LAYOUT;
    }

    private static final long relationship_events$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct IDiscordRelationshipEvents *relationship_events
     * }
     */
    public static final long relationship_events$offset() {
        return relationship_events$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct IDiscordRelationshipEvents *relationship_events
     * }
     */
    public static MemorySegment relationship_events(MemorySegment struct) {
        return struct.get(relationship_events$LAYOUT, relationship_events$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct IDiscordRelationshipEvents *relationship_events
     * }
     */
    public static void relationship_events(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(relationship_events$LAYOUT, relationship_events$OFFSET, fieldValue);
    }

    private static final OfInt relationship_version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("relationship_version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordVersion relationship_version
     * }
     */
    public static final OfInt relationship_version$layout() {
        return relationship_version$LAYOUT;
    }

    private static final long relationship_version$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordVersion relationship_version
     * }
     */
    public static final long relationship_version$offset() {
        return relationship_version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordVersion relationship_version
     * }
     */
    public static int relationship_version(MemorySegment struct) {
        return struct.get(relationship_version$LAYOUT, relationship_version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordVersion relationship_version
     * }
     */
    public static void relationship_version(MemorySegment struct, int fieldValue) {
        struct.set(relationship_version$LAYOUT, relationship_version$OFFSET, fieldValue);
    }

    private static final AddressLayout lobby_events$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("lobby_events"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct IDiscordLobbyEvents *lobby_events
     * }
     */
    public static final AddressLayout lobby_events$layout() {
        return lobby_events$LAYOUT;
    }

    private static final long lobby_events$OFFSET = 112;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct IDiscordLobbyEvents *lobby_events
     * }
     */
    public static final long lobby_events$offset() {
        return lobby_events$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct IDiscordLobbyEvents *lobby_events
     * }
     */
    public static MemorySegment lobby_events(MemorySegment struct) {
        return struct.get(lobby_events$LAYOUT, lobby_events$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct IDiscordLobbyEvents *lobby_events
     * }
     */
    public static void lobby_events(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(lobby_events$LAYOUT, lobby_events$OFFSET, fieldValue);
    }

    private static final OfInt lobby_version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("lobby_version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordVersion lobby_version
     * }
     */
    public static final OfInt lobby_version$layout() {
        return lobby_version$LAYOUT;
    }

    private static final long lobby_version$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordVersion lobby_version
     * }
     */
    public static final long lobby_version$offset() {
        return lobby_version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordVersion lobby_version
     * }
     */
    public static int lobby_version(MemorySegment struct) {
        return struct.get(lobby_version$LAYOUT, lobby_version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordVersion lobby_version
     * }
     */
    public static void lobby_version(MemorySegment struct, int fieldValue) {
        struct.set(lobby_version$LAYOUT, lobby_version$OFFSET, fieldValue);
    }

    private static final AddressLayout network_events$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("network_events"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct IDiscordNetworkEvents *network_events
     * }
     */
    public static final AddressLayout network_events$layout() {
        return network_events$LAYOUT;
    }

    private static final long network_events$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct IDiscordNetworkEvents *network_events
     * }
     */
    public static final long network_events$offset() {
        return network_events$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct IDiscordNetworkEvents *network_events
     * }
     */
    public static MemorySegment network_events(MemorySegment struct) {
        return struct.get(network_events$LAYOUT, network_events$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct IDiscordNetworkEvents *network_events
     * }
     */
    public static void network_events(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(network_events$LAYOUT, network_events$OFFSET, fieldValue);
    }

    private static final OfInt network_version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("network_version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordVersion network_version
     * }
     */
    public static final OfInt network_version$layout() {
        return network_version$LAYOUT;
    }

    private static final long network_version$OFFSET = 136;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordVersion network_version
     * }
     */
    public static final long network_version$offset() {
        return network_version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordVersion network_version
     * }
     */
    public static int network_version(MemorySegment struct) {
        return struct.get(network_version$LAYOUT, network_version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordVersion network_version
     * }
     */
    public static void network_version(MemorySegment struct, int fieldValue) {
        struct.set(network_version$LAYOUT, network_version$OFFSET, fieldValue);
    }

    private static final AddressLayout overlay_events$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("overlay_events"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct IDiscordOverlayEvents *overlay_events
     * }
     */
    public static final AddressLayout overlay_events$layout() {
        return overlay_events$LAYOUT;
    }

    private static final long overlay_events$OFFSET = 144;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct IDiscordOverlayEvents *overlay_events
     * }
     */
    public static final long overlay_events$offset() {
        return overlay_events$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct IDiscordOverlayEvents *overlay_events
     * }
     */
    public static MemorySegment overlay_events(MemorySegment struct) {
        return struct.get(overlay_events$LAYOUT, overlay_events$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct IDiscordOverlayEvents *overlay_events
     * }
     */
    public static void overlay_events(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(overlay_events$LAYOUT, overlay_events$OFFSET, fieldValue);
    }

    private static final OfInt overlay_version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("overlay_version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordVersion overlay_version
     * }
     */
    public static final OfInt overlay_version$layout() {
        return overlay_version$LAYOUT;
    }

    private static final long overlay_version$OFFSET = 152;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordVersion overlay_version
     * }
     */
    public static final long overlay_version$offset() {
        return overlay_version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordVersion overlay_version
     * }
     */
    public static int overlay_version(MemorySegment struct) {
        return struct.get(overlay_version$LAYOUT, overlay_version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordVersion overlay_version
     * }
     */
    public static void overlay_version(MemorySegment struct, int fieldValue) {
        struct.set(overlay_version$LAYOUT, overlay_version$OFFSET, fieldValue);
    }

    private static final AddressLayout storage_events$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("storage_events"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * IDiscordStorageEvents *storage_events
     * }
     */
    public static final AddressLayout storage_events$layout() {
        return storage_events$LAYOUT;
    }

    private static final long storage_events$OFFSET = 160;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * IDiscordStorageEvents *storage_events
     * }
     */
    public static final long storage_events$offset() {
        return storage_events$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * IDiscordStorageEvents *storage_events
     * }
     */
    public static MemorySegment storage_events(MemorySegment struct) {
        return struct.get(storage_events$LAYOUT, storage_events$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * IDiscordStorageEvents *storage_events
     * }
     */
    public static void storage_events(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(storage_events$LAYOUT, storage_events$OFFSET, fieldValue);
    }

    private static final OfInt storage_version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("storage_version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordVersion storage_version
     * }
     */
    public static final OfInt storage_version$layout() {
        return storage_version$LAYOUT;
    }

    private static final long storage_version$OFFSET = 168;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordVersion storage_version
     * }
     */
    public static final long storage_version$offset() {
        return storage_version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordVersion storage_version
     * }
     */
    public static int storage_version(MemorySegment struct) {
        return struct.get(storage_version$LAYOUT, storage_version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordVersion storage_version
     * }
     */
    public static void storage_version(MemorySegment struct, int fieldValue) {
        struct.set(storage_version$LAYOUT, storage_version$OFFSET, fieldValue);
    }

    private static final AddressLayout store_events$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("store_events"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct IDiscordStoreEvents *store_events
     * }
     */
    public static final AddressLayout store_events$layout() {
        return store_events$LAYOUT;
    }

    private static final long store_events$OFFSET = 176;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct IDiscordStoreEvents *store_events
     * }
     */
    public static final long store_events$offset() {
        return store_events$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct IDiscordStoreEvents *store_events
     * }
     */
    public static MemorySegment store_events(MemorySegment struct) {
        return struct.get(store_events$LAYOUT, store_events$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct IDiscordStoreEvents *store_events
     * }
     */
    public static void store_events(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(store_events$LAYOUT, store_events$OFFSET, fieldValue);
    }

    private static final OfInt store_version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("store_version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordVersion store_version
     * }
     */
    public static final OfInt store_version$layout() {
        return store_version$LAYOUT;
    }

    private static final long store_version$OFFSET = 184;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordVersion store_version
     * }
     */
    public static final long store_version$offset() {
        return store_version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordVersion store_version
     * }
     */
    public static int store_version(MemorySegment struct) {
        return struct.get(store_version$LAYOUT, store_version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordVersion store_version
     * }
     */
    public static void store_version(MemorySegment struct, int fieldValue) {
        struct.set(store_version$LAYOUT, store_version$OFFSET, fieldValue);
    }

    private static final AddressLayout voice_events$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("voice_events"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct IDiscordVoiceEvents *voice_events
     * }
     */
    public static final AddressLayout voice_events$layout() {
        return voice_events$LAYOUT;
    }

    private static final long voice_events$OFFSET = 192;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct IDiscordVoiceEvents *voice_events
     * }
     */
    public static final long voice_events$offset() {
        return voice_events$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct IDiscordVoiceEvents *voice_events
     * }
     */
    public static MemorySegment voice_events(MemorySegment struct) {
        return struct.get(voice_events$LAYOUT, voice_events$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct IDiscordVoiceEvents *voice_events
     * }
     */
    public static void voice_events(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(voice_events$LAYOUT, voice_events$OFFSET, fieldValue);
    }

    private static final OfInt voice_version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("voice_version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordVersion voice_version
     * }
     */
    public static final OfInt voice_version$layout() {
        return voice_version$LAYOUT;
    }

    private static final long voice_version$OFFSET = 200;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordVersion voice_version
     * }
     */
    public static final long voice_version$offset() {
        return voice_version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordVersion voice_version
     * }
     */
    public static int voice_version(MemorySegment struct) {
        return struct.get(voice_version$LAYOUT, voice_version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordVersion voice_version
     * }
     */
    public static void voice_version(MemorySegment struct, int fieldValue) {
        struct.set(voice_version$LAYOUT, voice_version$OFFSET, fieldValue);
    }

    private static final AddressLayout achievement_events$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("achievement_events"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct IDiscordAchievementEvents *achievement_events
     * }
     */
    public static final AddressLayout achievement_events$layout() {
        return achievement_events$LAYOUT;
    }

    private static final long achievement_events$OFFSET = 208;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct IDiscordAchievementEvents *achievement_events
     * }
     */
    public static final long achievement_events$offset() {
        return achievement_events$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct IDiscordAchievementEvents *achievement_events
     * }
     */
    public static MemorySegment achievement_events(MemorySegment struct) {
        return struct.get(achievement_events$LAYOUT, achievement_events$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct IDiscordAchievementEvents *achievement_events
     * }
     */
    public static void achievement_events(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(achievement_events$LAYOUT, achievement_events$OFFSET, fieldValue);
    }

    private static final OfInt achievement_version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("achievement_version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordVersion achievement_version
     * }
     */
    public static final OfInt achievement_version$layout() {
        return achievement_version$LAYOUT;
    }

    private static final long achievement_version$OFFSET = 216;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordVersion achievement_version
     * }
     */
    public static final long achievement_version$offset() {
        return achievement_version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordVersion achievement_version
     * }
     */
    public static int achievement_version(MemorySegment struct) {
        return struct.get(achievement_version$LAYOUT, achievement_version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordVersion achievement_version
     * }
     */
    public static void achievement_version(MemorySegment struct, int fieldValue) {
        struct.set(achievement_version$LAYOUT, achievement_version$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
