package discord.gamesdk;// Generated by jextract

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct DiscordActivity {
 *     enum EDiscordActivityType type;
 *     int64_t application_id;
 *     char name[128];
 *     char state[128];
 *     char details[128];
 *     struct DiscordActivityTimestamps timestamps;
 *     struct DiscordActivityAssets assets;
 *     struct DiscordActivityParty party;
 *     struct DiscordActivitySecrets secrets;
 *     bool instance;
 *     uint32_t supported_platforms;
 * }
 * }
 */
public class DiscordActivity {

    DiscordActivity() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        discord_game_sdk_h.C_INT.withName("type"),
        MemoryLayout.paddingLayout(4),
        discord_game_sdk_h.C_LONG_LONG.withName("application_id"),
        MemoryLayout.sequenceLayout(128, discord_game_sdk_h.C_CHAR).withName("name"),
        MemoryLayout.sequenceLayout(128, discord_game_sdk_h.C_CHAR).withName("state"),
        MemoryLayout.sequenceLayout(128, discord_game_sdk_h.C_CHAR).withName("details"),
        DiscordActivityTimestamps.layout().withName("timestamps"),
        DiscordActivityAssets.layout().withName("assets"),
        DiscordActivityParty.layout().withName("party"),
        DiscordActivitySecrets.layout().withName("secrets"),
        discord_game_sdk_h.C_BOOL.withName("instance"),
        MemoryLayout.paddingLayout(3),
        discord_game_sdk_h.C_INT.withName("supported_platforms"),
        MemoryLayout.paddingLayout(4)
    ).withName("DiscordActivity");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum EDiscordActivityType type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum EDiscordActivityType type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum EDiscordActivityType type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum EDiscordActivityType type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final OfLong application_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("application_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int64_t application_id
     * }
     */
    public static final OfLong application_id$layout() {
        return application_id$LAYOUT;
    }

    private static final long application_id$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int64_t application_id
     * }
     */
    public static final long application_id$offset() {
        return application_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int64_t application_id
     * }
     */
    public static long application_id(MemorySegment struct) {
        return struct.get(application_id$LAYOUT, application_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int64_t application_id
     * }
     */
    public static void application_id(MemorySegment struct, long fieldValue) {
        struct.set(application_id$LAYOUT, application_id$OFFSET, fieldValue);
    }

    private static final SequenceLayout name$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char name[128]
     * }
     */
    public static final SequenceLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char name[128]
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char name[128]
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.asSlice(name$OFFSET, name$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char name[128]
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, name$OFFSET, name$LAYOUT.byteSize());
    }

    private static long[] name$DIMS = { 128 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char name[128]
     * }
     */
    public static long[] name$dimensions() {
        return name$DIMS;
    }
    private static final VarHandle name$ELEM_HANDLE = name$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char name[128]
     * }
     */
    public static byte name(MemorySegment struct, long index0) {
        return (byte)name$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char name[128]
     * }
     */
    public static void name(MemorySegment struct, long index0, byte fieldValue) {
        name$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final SequenceLayout state$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("state"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char state[128]
     * }
     */
    public static final SequenceLayout state$layout() {
        return state$LAYOUT;
    }

    private static final long state$OFFSET = 144;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char state[128]
     * }
     */
    public static final long state$offset() {
        return state$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char state[128]
     * }
     */
    public static MemorySegment state(MemorySegment struct) {
        return struct.asSlice(state$OFFSET, state$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char state[128]
     * }
     */
    public static void state(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, state$OFFSET, state$LAYOUT.byteSize());
    }

    private static long[] state$DIMS = { 128 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char state[128]
     * }
     */
    public static long[] state$dimensions() {
        return state$DIMS;
    }
    private static final VarHandle state$ELEM_HANDLE = state$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char state[128]
     * }
     */
    public static byte state(MemorySegment struct, long index0) {
        return (byte)state$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char state[128]
     * }
     */
    public static void state(MemorySegment struct, long index0, byte fieldValue) {
        state$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final SequenceLayout details$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("details"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char details[128]
     * }
     */
    public static final SequenceLayout details$layout() {
        return details$LAYOUT;
    }

    private static final long details$OFFSET = 272;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char details[128]
     * }
     */
    public static final long details$offset() {
        return details$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char details[128]
     * }
     */
    public static MemorySegment details(MemorySegment struct) {
        return struct.asSlice(details$OFFSET, details$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char details[128]
     * }
     */
    public static void details(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, details$OFFSET, details$LAYOUT.byteSize());
    }

    private static long[] details$DIMS = { 128 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char details[128]
     * }
     */
    public static long[] details$dimensions() {
        return details$DIMS;
    }
    private static final VarHandle details$ELEM_HANDLE = details$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char details[128]
     * }
     */
    public static byte details(MemorySegment struct, long index0) {
        return (byte)details$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char details[128]
     * }
     */
    public static void details(MemorySegment struct, long index0, byte fieldValue) {
        details$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final GroupLayout timestamps$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("timestamps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct DiscordActivityTimestamps timestamps
     * }
     */
    public static final GroupLayout timestamps$layout() {
        return timestamps$LAYOUT;
    }

    private static final long timestamps$OFFSET = 400;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct DiscordActivityTimestamps timestamps
     * }
     */
    public static final long timestamps$offset() {
        return timestamps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct DiscordActivityTimestamps timestamps
     * }
     */
    public static MemorySegment timestamps(MemorySegment struct) {
        return struct.asSlice(timestamps$OFFSET, timestamps$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct DiscordActivityTimestamps timestamps
     * }
     */
    public static void timestamps(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, timestamps$OFFSET, timestamps$LAYOUT.byteSize());
    }

    private static final GroupLayout assets$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("assets"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct DiscordActivityAssets assets
     * }
     */
    public static final GroupLayout assets$layout() {
        return assets$LAYOUT;
    }

    private static final long assets$OFFSET = 416;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct DiscordActivityAssets assets
     * }
     */
    public static final long assets$offset() {
        return assets$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct DiscordActivityAssets assets
     * }
     */
    public static MemorySegment assets(MemorySegment struct) {
        return struct.asSlice(assets$OFFSET, assets$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct DiscordActivityAssets assets
     * }
     */
    public static void assets(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, assets$OFFSET, assets$LAYOUT.byteSize());
    }

    private static final GroupLayout party$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("party"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct DiscordActivityParty party
     * }
     */
    public static final GroupLayout party$layout() {
        return party$LAYOUT;
    }

    private static final long party$OFFSET = 928;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct DiscordActivityParty party
     * }
     */
    public static final long party$offset() {
        return party$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct DiscordActivityParty party
     * }
     */
    public static MemorySegment party(MemorySegment struct) {
        return struct.asSlice(party$OFFSET, party$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct DiscordActivityParty party
     * }
     */
    public static void party(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, party$OFFSET, party$LAYOUT.byteSize());
    }

    private static final GroupLayout secrets$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("secrets"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct DiscordActivitySecrets secrets
     * }
     */
    public static final GroupLayout secrets$layout() {
        return secrets$LAYOUT;
    }

    private static final long secrets$OFFSET = 1068;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct DiscordActivitySecrets secrets
     * }
     */
    public static final long secrets$offset() {
        return secrets$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct DiscordActivitySecrets secrets
     * }
     */
    public static MemorySegment secrets(MemorySegment struct) {
        return struct.asSlice(secrets$OFFSET, secrets$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct DiscordActivitySecrets secrets
     * }
     */
    public static void secrets(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, secrets$OFFSET, secrets$LAYOUT.byteSize());
    }

    private static final OfBoolean instance$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("instance"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool instance
     * }
     */
    public static final OfBoolean instance$layout() {
        return instance$LAYOUT;
    }

    private static final long instance$OFFSET = 1452;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool instance
     * }
     */
    public static final long instance$offset() {
        return instance$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool instance
     * }
     */
    public static boolean instance(MemorySegment struct) {
        return struct.get(instance$LAYOUT, instance$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool instance
     * }
     */
    public static void instance(MemorySegment struct, boolean fieldValue) {
        struct.set(instance$LAYOUT, instance$OFFSET, fieldValue);
    }

    private static final OfInt supported_platforms$LAYOUT = (OfInt)$LAYOUT.select(groupElement("supported_platforms"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t supported_platforms
     * }
     */
    public static final OfInt supported_platforms$layout() {
        return supported_platforms$LAYOUT;
    }

    private static final long supported_platforms$OFFSET = 1456;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t supported_platforms
     * }
     */
    public static final long supported_platforms$offset() {
        return supported_platforms$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t supported_platforms
     * }
     */
    public static int supported_platforms(MemorySegment struct) {
        return struct.get(supported_platforms$LAYOUT, supported_platforms$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t supported_platforms
     * }
     */
    public static void supported_platforms(MemorySegment struct, int fieldValue) {
        struct.set(supported_platforms$LAYOUT, supported_platforms$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

