package discord.gamesdk;// Generated by jextract

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct DiscordImeUnderline {
 *     int32_t from;
 *     int32_t to;
 *     uint32_t color;
 *     uint32_t background_color;
 *     bool thick;
 * }
 * }
 */
public class DiscordImeUnderline {

    DiscordImeUnderline() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        discord_game_sdk_h.C_INT.withName("from"),
        discord_game_sdk_h.C_INT.withName("to"),
        discord_game_sdk_h.C_INT.withName("color"),
        discord_game_sdk_h.C_INT.withName("background_color"),
        discord_game_sdk_h.C_BOOL.withName("thick"),
        MemoryLayout.paddingLayout(3)
    ).withName("DiscordImeUnderline");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt from$LAYOUT = (OfInt)$LAYOUT.select(groupElement("from"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t from
     * }
     */
    public static final OfInt from$layout() {
        return from$LAYOUT;
    }

    private static final long from$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t from
     * }
     */
    public static final long from$offset() {
        return from$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t from
     * }
     */
    public static int from(MemorySegment struct) {
        return struct.get(from$LAYOUT, from$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t from
     * }
     */
    public static void from(MemorySegment struct, int fieldValue) {
        struct.set(from$LAYOUT, from$OFFSET, fieldValue);
    }

    private static final OfInt to$LAYOUT = (OfInt)$LAYOUT.select(groupElement("to"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t to
     * }
     */
    public static final OfInt to$layout() {
        return to$LAYOUT;
    }

    private static final long to$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t to
     * }
     */
    public static final long to$offset() {
        return to$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t to
     * }
     */
    public static int to(MemorySegment struct) {
        return struct.get(to$LAYOUT, to$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t to
     * }
     */
    public static void to(MemorySegment struct, int fieldValue) {
        struct.set(to$LAYOUT, to$OFFSET, fieldValue);
    }

    private static final OfInt color$LAYOUT = (OfInt)$LAYOUT.select(groupElement("color"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t color
     * }
     */
    public static final OfInt color$layout() {
        return color$LAYOUT;
    }

    private static final long color$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t color
     * }
     */
    public static final long color$offset() {
        return color$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t color
     * }
     */
    public static int color(MemorySegment struct) {
        return struct.get(color$LAYOUT, color$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t color
     * }
     */
    public static void color(MemorySegment struct, int fieldValue) {
        struct.set(color$LAYOUT, color$OFFSET, fieldValue);
    }

    private static final OfInt background_color$LAYOUT = (OfInt)$LAYOUT.select(groupElement("background_color"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t background_color
     * }
     */
    public static final OfInt background_color$layout() {
        return background_color$LAYOUT;
    }

    private static final long background_color$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t background_color
     * }
     */
    public static final long background_color$offset() {
        return background_color$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t background_color
     * }
     */
    public static int background_color(MemorySegment struct) {
        return struct.get(background_color$LAYOUT, background_color$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t background_color
     * }
     */
    public static void background_color(MemorySegment struct, int fieldValue) {
        struct.set(background_color$LAYOUT, background_color$OFFSET, fieldValue);
    }

    private static final OfBoolean thick$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("thick"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool thick
     * }
     */
    public static final OfBoolean thick$layout() {
        return thick$LAYOUT;
    }

    private static final long thick$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool thick
     * }
     */
    public static final long thick$offset() {
        return thick$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool thick
     * }
     */
    public static boolean thick(MemorySegment struct) {
        return struct.get(thick$LAYOUT, thick$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool thick
     * }
     */
    public static void thick(MemorySegment struct, boolean fieldValue) {
        struct.set(thick$LAYOUT, thick$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

