package discord.gamesdk;// Generated by jextract

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct DiscordLobby {
 *     DiscordLobbyId id;
 *     enum EDiscordLobbyType type;
 *     DiscordUserId owner_id;
 *     DiscordLobbySecret secret;
 *     uint32_t capacity;
 *     bool locked;
 * }
 * }
 */
public class DiscordLobby {

    DiscordLobby() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        discord_game_sdk_h.C_LONG_LONG.withName("id"),
        discord_game_sdk_h.C_INT.withName("type"),
        MemoryLayout.paddingLayout(4),
        discord_game_sdk_h.C_LONG_LONG.withName("owner_id"),
        MemoryLayout.sequenceLayout(128, discord_game_sdk_h.C_CHAR).withName("secret"),
        discord_game_sdk_h.C_INT.withName("capacity"),
        discord_game_sdk_h.C_BOOL.withName("locked"),
        MemoryLayout.paddingLayout(3)
    ).withName("DiscordLobby");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordLobbyId id
     * }
     */
    public static final OfLong id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordLobbyId id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordLobbyId id
     * }
     */
    public static long id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordLobbyId id
     * }
     */
    public static void id(MemorySegment struct, long fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * enum EDiscordLobbyType type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * enum EDiscordLobbyType type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * enum EDiscordLobbyType type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * enum EDiscordLobbyType type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final OfLong owner_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("owner_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordUserId owner_id
     * }
     */
    public static final OfLong owner_id$layout() {
        return owner_id$LAYOUT;
    }

    private static final long owner_id$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordUserId owner_id
     * }
     */
    public static final long owner_id$offset() {
        return owner_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordUserId owner_id
     * }
     */
    public static long owner_id(MemorySegment struct) {
        return struct.get(owner_id$LAYOUT, owner_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordUserId owner_id
     * }
     */
    public static void owner_id(MemorySegment struct, long fieldValue) {
        struct.set(owner_id$LAYOUT, owner_id$OFFSET, fieldValue);
    }

    private static final SequenceLayout secret$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("secret"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordLobbySecret secret
     * }
     */
    public static final SequenceLayout secret$layout() {
        return secret$LAYOUT;
    }

    private static final long secret$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordLobbySecret secret
     * }
     */
    public static final long secret$offset() {
        return secret$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordLobbySecret secret
     * }
     */
    public static MemorySegment secret(MemorySegment struct) {
        return struct.asSlice(secret$OFFSET, secret$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordLobbySecret secret
     * }
     */
    public static void secret(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, secret$OFFSET, secret$LAYOUT.byteSize());
    }

    private static final OfInt capacity$LAYOUT = (OfInt)$LAYOUT.select(groupElement("capacity"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t capacity
     * }
     */
    public static final OfInt capacity$layout() {
        return capacity$LAYOUT;
    }

    private static final long capacity$OFFSET = 152;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t capacity
     * }
     */
    public static final long capacity$offset() {
        return capacity$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t capacity
     * }
     */
    public static int capacity(MemorySegment struct) {
        return struct.get(capacity$LAYOUT, capacity$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t capacity
     * }
     */
    public static void capacity(MemorySegment struct, int fieldValue) {
        struct.set(capacity$LAYOUT, capacity$OFFSET, fieldValue);
    }

    private static final OfBoolean locked$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("locked"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool locked
     * }
     */
    public static final OfBoolean locked$layout() {
        return locked$LAYOUT;
    }

    private static final long locked$OFFSET = 156;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool locked
     * }
     */
    public static final long locked$offset() {
        return locked$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool locked
     * }
     */
    public static boolean locked(MemorySegment struct) {
        return struct.get(locked$LAYOUT, locked$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool locked
     * }
     */
    public static void locked(MemorySegment struct, boolean fieldValue) {
        struct.set(locked$LAYOUT, locked$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

