package discord.gamesdk;// Generated by jextract

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct DiscordUser {
 *     DiscordUserId id;
 *     char username[256];
 *     char discriminator[8];
 *     char avatar[128];
 *     bool bot;
 * }
 * }
 */
public class DiscordUser {

    DiscordUser() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        discord_game_sdk_h.C_LONG_LONG.withName("id"),
        MemoryLayout.sequenceLayout(256, discord_game_sdk_h.C_CHAR).withName("username"),
        MemoryLayout.sequenceLayout(8, discord_game_sdk_h.C_CHAR).withName("discriminator"),
        MemoryLayout.sequenceLayout(128, discord_game_sdk_h.C_CHAR).withName("avatar"),
        discord_game_sdk_h.C_BOOL.withName("bot"),
        MemoryLayout.paddingLayout(7)
    ).withName("DiscordUser");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordUserId id
     * }
     */
    public static final OfLong id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordUserId id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordUserId id
     * }
     */
    public static long id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordUserId id
     * }
     */
    public static void id(MemorySegment struct, long fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final SequenceLayout username$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("username"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char username[256]
     * }
     */
    public static final SequenceLayout username$layout() {
        return username$LAYOUT;
    }

    private static final long username$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char username[256]
     * }
     */
    public static final long username$offset() {
        return username$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char username[256]
     * }
     */
    public static MemorySegment username(MemorySegment struct) {
        return struct.asSlice(username$OFFSET, username$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char username[256]
     * }
     */
    public static void username(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, username$OFFSET, username$LAYOUT.byteSize());
    }

    private static long[] username$DIMS = { 256 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char username[256]
     * }
     */
    public static long[] username$dimensions() {
        return username$DIMS;
    }
    private static final VarHandle username$ELEM_HANDLE = username$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char username[256]
     * }
     */
    public static byte username(MemorySegment struct, long index0) {
        return (byte)username$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char username[256]
     * }
     */
    public static void username(MemorySegment struct, long index0, byte fieldValue) {
        username$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final SequenceLayout discriminator$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("discriminator"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char discriminator[8]
     * }
     */
    public static final SequenceLayout discriminator$layout() {
        return discriminator$LAYOUT;
    }

    private static final long discriminator$OFFSET = 264;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char discriminator[8]
     * }
     */
    public static final long discriminator$offset() {
        return discriminator$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char discriminator[8]
     * }
     */
    public static MemorySegment discriminator(MemorySegment struct) {
        return struct.asSlice(discriminator$OFFSET, discriminator$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char discriminator[8]
     * }
     */
    public static void discriminator(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, discriminator$OFFSET, discriminator$LAYOUT.byteSize());
    }

    private static long[] discriminator$DIMS = { 8 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char discriminator[8]
     * }
     */
    public static long[] discriminator$dimensions() {
        return discriminator$DIMS;
    }
    private static final VarHandle discriminator$ELEM_HANDLE = discriminator$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char discriminator[8]
     * }
     */
    public static byte discriminator(MemorySegment struct, long index0) {
        return (byte)discriminator$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char discriminator[8]
     * }
     */
    public static void discriminator(MemorySegment struct, long index0, byte fieldValue) {
        discriminator$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final SequenceLayout avatar$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("avatar"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char avatar[128]
     * }
     */
    public static final SequenceLayout avatar$layout() {
        return avatar$LAYOUT;
    }

    private static final long avatar$OFFSET = 272;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char avatar[128]
     * }
     */
    public static final long avatar$offset() {
        return avatar$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char avatar[128]
     * }
     */
    public static MemorySegment avatar(MemorySegment struct) {
        return struct.asSlice(avatar$OFFSET, avatar$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char avatar[128]
     * }
     */
    public static void avatar(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, avatar$OFFSET, avatar$LAYOUT.byteSize());
    }

    private static long[] avatar$DIMS = { 128 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char avatar[128]
     * }
     */
    public static long[] avatar$dimensions() {
        return avatar$DIMS;
    }
    private static final VarHandle avatar$ELEM_HANDLE = avatar$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char avatar[128]
     * }
     */
    public static byte avatar(MemorySegment struct, long index0) {
        return (byte)avatar$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char avatar[128]
     * }
     */
    public static void avatar(MemorySegment struct, long index0, byte fieldValue) {
        avatar$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final OfBoolean bot$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("bot"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool bot
     * }
     */
    public static final OfBoolean bot$layout() {
        return bot$LAYOUT;
    }

    private static final long bot$OFFSET = 400;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool bot
     * }
     */
    public static final long bot$offset() {
        return bot$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool bot
     * }
     */
    public static boolean bot(MemorySegment struct) {
        return struct.get(bot$LAYOUT, bot$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool bot
     * }
     */
    public static void bot(MemorySegment struct, boolean fieldValue) {
        struct.set(bot$LAYOUT, bot$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

