package discord.gamesdk;// Generated by jextract

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct DiscordUserAchievement {
 *     DiscordSnowflake user_id;
 *     DiscordSnowflake achievement_id;
 *     uint8_t percent_complete;
 *     DiscordDateTime unlocked_at;
 * }
 * }
 */
public class DiscordUserAchievement {

    DiscordUserAchievement() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        discord_game_sdk_h.C_LONG_LONG.withName("user_id"),
        discord_game_sdk_h.C_LONG_LONG.withName("achievement_id"),
        discord_game_sdk_h.C_CHAR.withName("percent_complete"),
        MemoryLayout.sequenceLayout(64, discord_game_sdk_h.C_CHAR).withName("unlocked_at"),
        MemoryLayout.paddingLayout(7)
    ).withName("DiscordUserAchievement");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong user_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("user_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordSnowflake user_id
     * }
     */
    public static final OfLong user_id$layout() {
        return user_id$LAYOUT;
    }

    private static final long user_id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordSnowflake user_id
     * }
     */
    public static final long user_id$offset() {
        return user_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordSnowflake user_id
     * }
     */
    public static long user_id(MemorySegment struct) {
        return struct.get(user_id$LAYOUT, user_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordSnowflake user_id
     * }
     */
    public static void user_id(MemorySegment struct, long fieldValue) {
        struct.set(user_id$LAYOUT, user_id$OFFSET, fieldValue);
    }

    private static final OfLong achievement_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("achievement_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordSnowflake achievement_id
     * }
     */
    public static final OfLong achievement_id$layout() {
        return achievement_id$LAYOUT;
    }

    private static final long achievement_id$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordSnowflake achievement_id
     * }
     */
    public static final long achievement_id$offset() {
        return achievement_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordSnowflake achievement_id
     * }
     */
    public static long achievement_id(MemorySegment struct) {
        return struct.get(achievement_id$LAYOUT, achievement_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordSnowflake achievement_id
     * }
     */
    public static void achievement_id(MemorySegment struct, long fieldValue) {
        struct.set(achievement_id$LAYOUT, achievement_id$OFFSET, fieldValue);
    }

    private static final OfByte percent_complete$LAYOUT = (OfByte)$LAYOUT.select(groupElement("percent_complete"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t percent_complete
     * }
     */
    public static final OfByte percent_complete$layout() {
        return percent_complete$LAYOUT;
    }

    private static final long percent_complete$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t percent_complete
     * }
     */
    public static final long percent_complete$offset() {
        return percent_complete$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t percent_complete
     * }
     */
    public static byte percent_complete(MemorySegment struct) {
        return struct.get(percent_complete$LAYOUT, percent_complete$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t percent_complete
     * }
     */
    public static void percent_complete(MemorySegment struct, byte fieldValue) {
        struct.set(percent_complete$LAYOUT, percent_complete$OFFSET, fieldValue);
    }

    private static final SequenceLayout unlocked_at$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("unlocked_at"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DiscordDateTime unlocked_at
     * }
     */
    public static final SequenceLayout unlocked_at$layout() {
        return unlocked_at$LAYOUT;
    }

    private static final long unlocked_at$OFFSET = 17;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DiscordDateTime unlocked_at
     * }
     */
    public static final long unlocked_at$offset() {
        return unlocked_at$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DiscordDateTime unlocked_at
     * }
     */
    public static MemorySegment unlocked_at(MemorySegment struct) {
        return struct.asSlice(unlocked_at$OFFSET, unlocked_at$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DiscordDateTime unlocked_at
     * }
     */
    public static void unlocked_at(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, unlocked_at$OFFSET, unlocked_at$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

